Repository: alexisserapio/chef_bot
Catalog: lib/l10n/app_*.arb
Languages: es

# greeting
source: Hello! 👨‍🍳
es: ¡Hola! 👨‍🍳

# welcome
source: Welcome to ChefBot
es: Bienvenido a ChefBot

# selectOption
source: Select one of the two options:
es: Selecciona una de las dos opciones:

# chatButton
source: Chat with ChefBot
es: Chatea con ChefBot

# httpButton
source: Perform HTTP operations
es: Realiza operaciones HTTP

# textFieldHint
source: Type your message...
es: Escribe tu mensaje...

# botThinking
source: Typing...
es: Escribiendo...

# userDisplay
source: You
es: Tú

# httpTitle
source: Hello!
es: ¡Hola!

# httpSubtitle
source: Here is a random recipe:
es: Aquí tienes una receta aleatoria:

# httpError
source: An error occurred while retrieving the recipe, please try again
es: Ocurrió un error al recuperar la receta, intenta nuevamente

# searchFieldHint
source: Search Recipes
es: Buscar Recetas

# instructionsTitle
source: How to make the requests?
es: ¿Cómo realizar las peticiones?

# firstInstructions
source: 1. Enter a recipe to search in TheMealDB API
es: 1. Escribe una receta a buscar en TheMealDB API

# firstSubText
source: (External Information Query)
es: (Consulta de Informacion Externa)

# secondInstructions
source: 2. Then add your recipe to favorites by clicking the star icon
es: 2. Posteriormente agrega tu receta a favoritos dando clic en el icon de la estrella

# secondSubText
source: (Simulated data submission, you can check the debug console and Pipedream URL)
es: (Envio simulado de datos, puedes consultar la deubg console y la url de Pipedream)

# noRecipesFoundOne
source: No recipes found
es: No se encontraron recetas

# noRecipesFoundTwo
source: Try writing in English or search for another recipe
es: Intenta escribir en idioma inglés o busca otra receta

# snackBarSuccessful
source: Recipe sent successfully
es: Receta enviada con éxito

# snackBarError
source: Error sending recipe
es: Error al enviar la receta
